# Brews
brew "aws-iam-authenticator"
brew "awscli"
brew "docker-credential-helper-ecr"
brew "ffmpeg"
brew "fish"
brew "gibo"
brew "go"
brew "golangci-lint"
brew "helm"
brew "jq"
brew "kubie"
brew "node@16"
# brew "rust" Not recommended, see: https://www.rust-lang.org/tools/install
brew "shellcheck"
brew "terraform"
brew "trash"
brew "tree"
brew "wifi-password"
brew "yarn"

# Casks
cask "appcleaner"
cask "arduino"
cask "autodesk-fusion360"
cask "aws-vault"
cask "balance-lock"
cask "discord"
cask "docker"
cask "element"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "gpg-suite"
cask "insomnia"
cask "iterm2"
cask "microsoft-teams"
cask "notion"
cask "nvidia-geforce-now"
cask "obsidian"
cask "rectangle"
cask "signal"
cask "slack"
cask "tableplus"
cask "ultimaker-cura"
cask "visual-studio-code"
cask "vlc"
cask "yed"
