# Brews
brew "aws-iam-authenticator"
brew "awscli"
brew "docker"
brew "docker-credential-helper-ecr"
brew "fish"
brew "gibo"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "helm"
brew "jq"
brew "keychain"
brew "kubie"
brew "lima"
brew "mage"
brew "node@20"
brew "openssh"
brew "pinentry-mac"
# brew "rust" Not recommended, see: https://www.rust-lang.org/tools/install
brew "shellcheck"
brew "terraform"
brew "trash"
brew "tree"
brew "wifi-password"
brew "yarn"

# Casks
cask "1password"
cask "appcleaner"
cask "arduino-ide"
cask "autodesk-fusion360"
cask "aws-vault"
cask "balance-lock"
cask "discord"
cask "ferdium"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "iterm2"
cask "microsoft-teams"
cask "notion"
cask "nvidia-geforce-now"
cask "obsidian"
cask "raspberry-pi-imager"
cask "rectangle"
cask "shifty"
cask "signal"
cask "tableplus"
cask "ultimaker-cura"
cask "visual-studio-code"
cask "vlc"
cask "yed"
